app/controllers/articles_controller.rb

  def index
    @articles = Article.order(sort_column + " " + sort_direction).paginate(:page => params[:page], :per_page => 10)
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params) # Assign first
    @article.user = current_user # Then access attributes/associations

    if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-12 03:37:32.365785"], ["text", "54321"], ["title", "12345"], ["updated_at", "2014-11-12 03:37:32.365785"]]